.doom.d/SUNRA.org
#+PROPERTY: header-args :tangle sunra.el

* Table of Contents
:PROPERTIES:
:TOC:      :include all :depth 3
:END:
:CONTENTS:
- [[#table-of-contents][Table of Contents]]
  - [[#reference][Reference]]
    - [[#eval-expressions-in-minibuffer][Eval expressions in minibuffer]]
    - [[#disable-whitespace-mode][Disable whitespace-mode]]
      - [[#disable-doom-highlight-non-default-indentation-h][Disable doom-highlight-non-default-indentation-h]]
      - [[#disable-doom-first-buffer-hook][Disable doom-first-buffer-hook]]
      - [[#disable-whitespace-globally][Disable whitespace globally]]
    - [[#kill-groups-of-buffers][Kill groups of buffers]]
    - [[#index-of-buffer-positions][Index of buffer positions]]
    - [[#replace-across-files-grep-wgrep-mode][Replace across files, grep, wgrep mode]]
    - [[#changes-across-files][Changes across files]]
  - [[#general][General]]
    - [[#table-of-contents][Table Of Contents]]
    - [[#keybindings][Keybindings]]
    - [[#miscellaneous-configuration][Miscellaneous configuration]]
    - [[#use-org-mode-for-all-files-ending-with-notes][Use Org Mode for all files ending with .notes.]]
    - [[#general-navigation-and-text-actions][General Navigation and text actions.]]
    - [[#protesilaossubstitute][Protesilaos/Substitute]]
    - [[#free-keys][Free Keys]]
  - [[#avy][Avy]]
  - [[#navigation][Navigation]]
  - [[#smartparens-navigation][Smartparens Navigation]]
  - [[#multiple-cursors][Multiple cursors]]
  - [[#hide-show][Hide-Show]]
  - [[#cider][Cider]]
  - [[#miscellaneous][Miscellaneous]]
  - [[#copy-functions][Copy Functions]]
  - [[#completions][Completions]]
    - [[#context][Context]]
    - [[#research][Research]]
    - [[#outcome][Outcome]]
      - [[#a-these-are-the-packages-i-settled-on][A. These are the packages I settled on.]]
      - [[#b-lo-and-behold-these-are-most-of-the-choices-that-doom-makes-in-its-completionvertico-module][B. Lo and behold, these are most of the choices that Doom makes in its `completion/vertico` module.]]
      - [[#capfs][CAPFs]]
      - [[#consult][Consult]]
      - [[#embark-consult][Embark Consult]]
  - [[#denote-org-roam-replacement][Denote (Org-Roam replacement)]]
    - [[#oldarchive-org-roam][OLD:ARCHIVE: Org-Roam]]
  - [[#chatgpt][ChatGPT]]
  - [[#private-sunra-config][Private Sunra Config]]
  - [[#emacs-client][Emacs Client]]
  - [[#miscellaneous][Miscellaneous]]
    - [[#define-persistent-link-in-org][Define persistent link in Org]]
    - [[#configuration-org-insert-structure-template][Configuration: org-insert-structure-template]]
    - [[#outlining-structured-files][Outlining Structured Files]]
    - [[#embark-keymap-configuration][Embark Keymap Configuration]]
    - [[#insert-text-in-read-only-buffers][Insert Text in read-only Buffers]]
    - [[#emacs-window-management][Emacs Window Management]]
  - [[#todos][TODOs]]
    - [[#org-roam-existing-notes][Org-Roam Existing Notes]]
    - [[#configure-completion][Configure Completion]]
    - [[#consult-search-ignore-case][Consult search, ignore case]]
    - [[#navigate-mark-ring][Navigate Mark Ring]]
    - [[#master-keymaps][Master Keymaps]]
    - [[#misc][Misc]]
    - [[#org-journaling][Org Journaling]]
    - [[#org-presenting][Org Presenting]]
    - [[#spellcheck-tools-and-completions][Spellcheck Tools and Completions]]
  - [[#errors][Errors]]
    - [[#org-roam-insert-doesnt-find-new-notes][`org-roam-insert` doesn't find new notes]]
    - [[#ripgrep-is-missing-from-path][Ripgrep is missing from path]]
    - [[#hydra-mcmark-next-line-double-marks-cursor][Hydra mc/mark-next-line double marks cursor]]
    - [[#smartparens-open-square-bracket-fails-to-add-closing-bracket-when-touched-by-a-character][smartparens open square bracket fails to add closing bracket, when touched by a character]]
:END:

# NOTE preserve line breaks
# https://emacs.stackexchange.com/questions/21556/org-mode-export-how-to-force-newline-on-lines-between-paragraphs
#+OPTIONS: \n:t

** Reference

*** References

The Emacs Package Developer’s Handbook.
https://github.com/alphapapa/emacs-package-dev-handbook

Awesome Elisp. A curated list of Emacs Lisp development resources.
https://github.com/emacs-tw/awesome-elisp


*** Eval expressions in minibuffer

Show minibuffer to eval expressions.

#+BEGIN_EXAMPLE
M-:
#+END_EXAMPLE


*** Howto replace a character with a newline

StackOverflow: How can I replace a character with a newline in Emacs?
https://stackoverflow.com/questions/613022/how-can-i-replace-a-character-with-a-newline-in-emacs/613029#613029

~C-q C-j~
- C-q for quoted-insert
- C-j is a newline


*** Disable whitespace-mode

**** Disable =doom-highlight-non-default-indentation-h=

Highlight + Indent seems to be enabled when entering a new file / major mode. =doom-highlight-non-default-indentation-h= "Highlight whitespace at odds with `indent-tabs-mode'".

By using =remove-hook= the intent here is to remove whitespace-mode, which doom has disabled by default.

#+BEGIN_SRC elisp
(remove-hook 'after-change-major-mode-hook
             #'doom-highlight-non-default-indentation-h)
#+END_SRC

**** Disable =doom-first-buffer-hook=

=doom-first-buffer-hook= is a "Transient hooks run before the first interactively opened buffer."

Using =remove-hook= should remove the hook that enables =global-whitespace-mode= for the first buffer that is opened, ensuring that whitespace mode is never enabled, regardless of the circumstances.

#+BEGIN_SRC elisp
(remove-hook 'doom-first-buffer-hook
             #'global-whitespace-mode)
#+END_SRC

**** Disable whitespace globally

Attempting to disable whitespace in all the places.

#+BEGIN_SRC elisp
(defun sunra/do-before-after-init ()
  "Function to run before anything during Doom initialization."

  (global-whitespace-mode -1)
  (flycheck-mode -1))

(add-hook 'doom-before-modules-init-hook #'sunra/do-before-after-init)
(add-hook 'doom-after-modules-init-hook #'sunra/do-before-after-init)
#+END_SRC


*** Kill groups of buffers

Use =ibuffer= (also use w/ embark).
Follow the same pattern as dired... Mark then delete.


*** Index of buffer positions

https://protesilaos.com/codelog/2021-01-06-emacs-default-completion/

For a large structured file (.org .el etc), =consult-outline= and =consult-imenu= produce outline buffers.
This works as an index of buffer positions, that acts as a "table of contents".
=embark-occur= produces a persistent buffer.

#+BEGIN_EXAMPLE
consult-outline
consult-imenu
embark-occur
#+END_EXAMPLE

#+BEGIN_SRC elisp
(map! :map general-override-mode-map
      "M-m s o" #'consult-outline)
#+END_SRC


outline-minor-mode let's you define outline regex as a heading.
The variable outline-regexp can be changed to control what is a heading.
A line is a heading if outline-regexp matches something at the
beginning of the line. The longer the match, the deeper the level.

#+BEGIN_EXAMPLE
outline-minor-mode ;; Let's you define outline regex as a heading
outline-regexp
#+END_EXAMPLE


*** Replace across files, grep, wgrep mode

Search w/ grep (results must be on one line)

#+BEGIN_EXAMPLE
grep
projectile-grep
grep-find  # Perform rgrep in the project.
find-grep
find-grep-dired  # Find output is put into dired buffer
#+END_EXAMPLE

Replace + Write changes of multiple matches
C-c C-c (commit change)

#+BEGIN_EXAMPLE
wgrep-change-to-wgrep-mode     Change to wgrep mode.
wgrep-save-all-buffers         Save the buffers that wgrep changed.
wgrep-finish-edit           (C-x C-s)    Apply changes to file buffers.
wgrep-exit                  (C-x C-q)    Return to original mode.
wgrep-abort-changes            Discard all changes and return to original mo…
wgrep-mark-deletion            Mark as delete to current line.
wgrep-remove-change         (C-c C-r)    Remove changes in the region between BEG and …
wgrep-remove-all-change        Remove changes in the whole buffer.
wgrep-toggle-readonly-area     Toggle read-only area to remove a whole line.
#+END_EXAMPLE


*** Changes across files

Keyboard macros let us make multi-line changes across files.

#+BEGIN_EXAMPLE
kmacro-start-macro-or-insert-counter  # <f3>
kmacro-end-or-call-macro  # <f4>
kmacro-ring
desktop-save-mode  # saves keyboard macros, registers, any variable
#+END_EXAMPLE

Recreates variables at startup (including buffers, frames, registers...).

#+BEGIN_SRC elisp
(desktop-save-mode 1)

(add-to-list 'desktop-globals-to-save 'log-edit-comment-ring)
(add-to-list 'desktop-globals-to-save 'kmacro-ring)
(add-to-list 'desktop-globals-to-save 'kill-ring)
#+END_SRC



*** Emacs Thought Leaders

Karthink

https://github.com/karthink?tab=repositories&q=&type=&language=&sort=stargazers
https://www.youtube.com/@karthink/videos

Protesilaos

https://github.com/protesilaos
https://www.youtube.com/c/ProtesilaosStavrou
https://protesilaos.com/
https://protesilaos.com/emacs/dotemacs

Andrew Tropin

https://www.youtube.com/playlist?list=PLZmotIJq3yOKmJP_qTozdJ45hnOlOWWC5



** General

*** Table Of Contents

Using [[https://github.com/alphapapa/org-make-toc][alphapapa/org-make-toc]] for automatic Tables of Contents for Org-mode files.
Usage instructions [[https://github.com/alphapapa/org-make-toc?tab=readme-ov-file#usage][are here]].

#+BEGIN_SRC elisp

;; (use-package! org-make-toc
;;   :ensure t)

#+END_SRC


*** Keybindings


Elisp

# TODO, clashing with multiple cursors

#+BEGIN_SRC elisp
(map! :map general-override-mode-map
      "C-c l e m" #'pp-macro-expand-last-expression
      "C-c l e D" #'eval-defun-at-point)
#+END_SRC


Embark

#+BEGIN_SRC elisp
;; (map! :map general-override-mode-map
;;       "C-M a" #'embark-act
;;       "C-M e" #'embark-export
;;       "C-M c" #'embark-collect)
#+END_SRC


Marks

=consult-global-mark= lets you cycle through the mark ring.

#+BEGIN_SRC elisp
(map! :map general-override-mode-map
      "C-x <up>" #'pop-global-mark
      "C-x <down>" #'consult-global-mark)
#+END_SRC


Eshell

# TODO, not overriding default keybindings

#+BEGIN_SRC pelisp
;; (map! :map general-override-mode-map
;;       "C-c o e" #'+eshell/here
;;       "C-c o E" #'+eshell/toggle)
#+END_SRC


Append to ...

#+BEGIN_SRC elisp
(map! :map general-override-mode-map
      "C-M-<" #'append-to-buffer)
#+END_SRC


GPTel

#+BEGIN_EXAMPLE elisp
gptel-send ;; (C-c RET in gptel-mode)
#+END_EXAMPLE


Avy

#+BEGIN_SRC elisp
(map! :map general-override-mode-map
      "C->" #'avy-goto-char-timer
      "C-M->" #'avy-goto-char-2)
#+END_SRC

Version Control
#+BEGIN_EXAMPLE elisp
vc-region-history  ;; C-x v h
#+END_EXAMPLE

# TODO, play around with these configs
# diff-refine-hunk
# magit-diff-toggle-refine-hunk


*** Miscellaneous configuration


#+BEGIN_EXAMPLE elisp
kill-whole-line  ;; C-S-<backspace>
#+END_EXAMPLE


#+BEGIN_SRC elisp
(setq

 ;; Set *scratch* buffer to lisp-interaction-mode
 ;; https://emacsredux.com/blog/2014/07/25/configure-the-scratch-buffers-mode/
 ;; https://emacs.stackexchange.com/questions/3830/why-does-lisp-interaction-mode-exist-and-do-we-ever-need-it
 initial-major-mode 'lisp-interaction-mode


 ;; If you use `org' and don't want your org files in the default location below,
 ;; change `org-directory'. It must be set before org loads!
 org-directory "~/org/"

 ;; This determines the style of line numbers in effect. If set to `nil', line
 ;; numbers are disabled. For relative line numbers, set this to `relative'.
 display-line-numbers-type t

 ;; Start from 1 when inserting numbers
 mc/insert-numbers-default 1

 ;; "confirm-kill-emacs is non-nil by default. The doom-quit module only adds silly confirmation messages to it. Do this to completely disable it."
 ;; https://github.com/doomemacs/doomemacs/issues/2688#issuecomment-596684817
 confirm-kill-emacs nil

 ;; Disable auto-comment on `newline-and-indent`
 ;; https://discord.com/channels/406534637242810369/1038583508140048425
 +default-want-RET-continue-comments nil
 +evil-want-o/O-to-continue-comments nil

 ;; When minibuffer offers tab completion, make that case-insensitive
 ;; https://emacs.stackexchange.com/a/32408/10528
 completion-ignore-case t)

(flycheck-mode -1)
#+END_SRC

#+RESULTS:


*** Use Org Mode for all files ending with .notes.

#+BEGIN_SRC elisp
(add-to-list 'auto-mode-alist '("\\.notes\\'" . org-mode))
#+END_SRC


