.doom.d/sunra.el
(remove-hook 'after-change-major-mode-hook
             #'doom-highlight-non-default-indentation-h)

(remove-hook 'doom-first-buffer-hook
             #'global-whitespace-mode)

(defun sunra/do-before-after-init ()
  "Function to run before anything during Doom initialization."

  (global-whitespace-mode -1)
  (flycheck-mode -1))

(add-hook 'doom-before-modules-init-hook #'sunra/do-before-after-init)
(add-hook 'doom-after-modules-init-hook #'sunra/do-before-after-init)

(map! :map general-override-mode-map
      "M-m s o" #'consult-outline)

(desktop-save-mode 1)

(add-to-list 'desktop-globals-to-save 'log-edit-comment-ring)
(add-to-list 'desktop-globals-to-save 'kmacro-ring)
(add-to-list 'desktop-globals-to-save 'kill-ring)

;; (use-package! org-make-toc
;;   :ensure t)

(map! :map general-override-mode-map
      "C-c l e m" #'pp-macro-expand-last-expression
      "C-c l e D" #'eval-defun-at-point)

;; (map! :map general-override-mode-map
;;       "C-M a" #'embark-act
;;       "C-M e" #'embark-export
;;       "C-M c" #'embark-collect)

(map! :map general-override-mode-map
      "C-x <up>" #'pop-global-mark
      "C-x <down>" #'consult-global-mark)

;; (map! :map general-override-mode-map
;;       "C-c o e" #'+eshell/here
;;       "C-c o E" #'+eshell/toggle)

(map! :map general-override-mode-map
      "C-M-<" #'append-to-buffer)

(map! :map general-override-mode-map
      "C->" #'avy-goto-char-timer
      "C-M->" #'avy-goto-char-2)

(setq

 ;; Set *scratch* buffer to lisp-interaction-mode
 ;; https://emacsredux.com/blog/2014/07/25/configure-the-scratch-buffers-mode/
 ;; https://emacs.stackexchange.com/questions/3830/why-does-lisp-interaction-mode-exist-and-do-we-ever-need-it
 initial-major-mode 'lisp-interaction-mode


 ;; If you use `org' and don't want your org files in the default location below,
 ;; change `org-directory'. It must be set before org loads!
 org-directory "~/org/"

 ;; This determines the style of line numbers in effect. If set to `nil', line
 ;; numbers are disabled. For relative line numbers, set this to `relative'.
 display-line-numbers-type t

 ;; Start from 1 when inserting numbers
 mc/insert-numbers-default 1

 ;; "confirm-kill-emacs is non-nil by default. The doom-quit module only adds silly confirmation messages to it. Do this to completely disable it."
 ;; https://github.com/doomemacs/doomemacs/issues/2688#issuecomment-596684817
 confirm-kill-emacs nil

 ;; Disable auto-comment on `newline-and-indent`
 ;; https://discord.com/channels/406534637242810369/1038583508140048425
 +default-want-RET-continue-comments nil
 +evil-want-o/O-to-continue-comments nil

 ;; When minibuffer offers tab completion, make that case-insensitive
 ;; https://emacs.stackexchange.com/a/32408/10528
 completion-ignore-case t)

(flycheck-mode -1)

(add-to-list 'auto-mode-alist '("\\.notes\\'" . org-mode))
