.doom.d/sunra.el

(global-set-key (kbd "C-c C-s") 'save-buffer)

(map! :map global-map
      "M-<backspace>" #'sp-backward-kill-word
      "C-c C-k" #'eval-buffer
      "C-c M-c" #'upcase-word
      "C-x M-x" #'isearch-forward-symbol-at-point
      "C-x RET" #'magit-status
      "M-W" #'delete-trailing-whitespace
      "C-/" #'org-cycle-global)

(map! :map general-override-mode-map
      "M-m p p" #'projectile-switch-project
      "M-m p f" #'projectile-find-file
      "M-m p r" #'projectile-replace
      "M-m p R" #'projectile-replace-regexp
      "M-m p S" #'projectile-save-project-buffers)

(use-package! substitute
  :config

  ;; If you want a message reporting the matches that changed in the
  ;; given context.  We don't do it by default.
  (add-hook 'substitute-post-replace-functions #'substitute-report-operation)

  ;; We do not bind any keys.  This is just an idea.  The mnemonic is
  ;; that M-# (or M-S-3) is close to M-% (or M-S-5).
  (let ((map global-map))
    (define-key map (kbd "M-# s") #'substitute-target-below-point)
    (define-key map (kbd "M-# r") #'substitute-target-above-point)
    (define-key map (kbd "M-# d") #'substitute-target-in-defun)
    (define-key map (kbd "M-# b") #'substitute-target-in-buffer)))

(use-package! free-keys)

(setq avy-all-windows 'all-frames)
(map! "C-c g c" #'avy-goto-char-2)

(fset 'buf-move-up "\C-u10\C-p")
(fset 'buf-move-down "\C-u10\C-n")
(map! "M-U" #'buf-move-up
      "M-D" #'buf-move-down
      "C-d" #'sp-kill-sexp)

(after! smartparens
  (turn-on-smartparens-strict-mode)
  (sp-pair "(" nil :unless '(:rem sp-point-before-word-p))
  (sp-pair "{" nil :unless '(:rem sp-point-before-word-p))
  (sp-pair "[" nil :unless '(:rem sp-point-before-word-p)))

(map! :map smartparens-mode-map
      :after smartparens
      "C-M-k" #'sp-copy-sexp
      "C-M-u" #'sp-up-sexp
      "M-u" #'sp-backward-up-sexp
      "C-M-d" #'sp-down-sexp
      "M-d" #'sp-backward-down-sexp
      "C-M-j" #'sp-forward-slurp-sexp
      "C-x C-M-j" #'sp-forward-barf-sexp
      "C-M-y" #'sp-backward-slurp-sexp
      "C-x C-M-y" #'sp-backward-barf-sexp
      "C-M-n" #'sp-next-sexp
      "M-r" #'sp-raise-sexp
      "DEL" #'sp-backward-delete-char)

(after! ace-window

  ;; Switch window letter SIZE
  (custom-set-faces
   '(aw-leading-char-face
     ((t (:inherit ace-jump-face-foreground :height 6.0)))))

  ;; Ensure ace-window works across frames.
  (setq aw-scope 'global))

(map! "M-[" #'ace-select-window
      "C-c M-[" #'ace-swap-window
      "C-x M-[" #'ace-delete-window
      ;; "M-y" #'browse-kill-ring
      "C-M-[" #'scroll-other-window-down
      "C-M-]" #'scroll-other-window
      "C-M-s" #'sp-splice-sexp
      "C-M-l" #'transpose-lines)

;; (map! "C-c m N l" #'mc/mark-next-lines
;;       "C-c m N t" #'mc/mark-next-like-this
;;       "C-c m N w" #'mc/mark-next-like-this-word
;;       "C-c m N W" #'mc/mark-next-word-like-this
;;       "C-c m N s" #'mc/mark-next-like-this-symbol
;;       "C-c m N S" #'mc/mark-next-symbol-like-this
;;       "C-c m P l" #'mc/mark-previous-lines
;;
;;       "C-c s n" #'mc/skip-to-next-like-this
;;       "C-c s p" #'mc/skip-to-previous-like-this
;;       "C-c m i n" #'mc/insert-numbers
;;
;;       "C-c m a t" #'mc/mark-all-like-this
;;       "C-c m a w" #'mc/mark-all-words-like-this
;;       "C-c m a s" #'mc/mark-all-symbols-like-this
;;       "C-c m a r" #'mc/mark-all-in-region
;;       "C-c m a x" #'mc/mark-all-in-region-regexp
;;       "C-c m a d" #'mc/mark-all-like-this-dwim
;;       "C-c m a D" #'mc/mark-all-dwim
;;
;;       "C-c m e l" #'mc/edit-lines
;;       "C-c m e b" #'mc/edit-beginnings-of-lines
;;       "C-c m e e" #'mc/edit-ends-of-lines)
;;
;; (map! "C-z" #'repeat)
;;
;; (map! "C-o" #'hs-toggle-hiding
;;       "C-c @ C-M-h" #'hs-hide-all
;;       "C-c @ C-M-s" #'hs-show-all
;;       "C-c @ C-M-l" #'hs-hide-level
;;       "C-M-," #'hs-hide-all
;;       "C-M-." #'hs-show-all
;;       "C-M-/" #'hs-hide-level)
;;
;; (after! cider
;;
;;   ;; DONT open new window on cider-connect, et al
;;   (setq cider-repl-pop-to-buffer-on-connect nil)
;;   (setq cider-auto-select-test-report-buffer nil)
;;   (setq cider-auto-select-error-buffer nil)
;;   (setq cider-show-error-buffer nil))
;;
;; (map! :after cider
;;       :map general-override-mode-map
;;       "C-c M-c" #'cider-connect-clj
;;       "C-c C-k" #'cider-eval-buffer)
;;
;; (map! :after clojure
;;       :map general-override-mode-map
;;       "C-c M-c" #'cider-connect-clj)
;;
;; (with-eval-after-load 'general
;;   (define-key general-override-mode-map (kbd "C-c M-c") nil))
;;
;; (defun delete-whitespace-except-one ()
;;   (interactive)
;;   (just-one-space -1))
;;
;; (map! "C-M-SPC" #'delete-whitespace-except-one
;;       "C-," #'+default/newline-above
;;       "C-." #'+default/newline-below)
;;
