.doom.d/SUNRA.org
** Copy Functions

Copy line

#+BEGIN_SRC elisp
(defun copy-line (&optional arg)
  "Do a kill-line but copy rather than kill.  This function directly calls
  kill-line, so see documentation of kill-line for how to use it including prefix
  argument and relevant variables.  This function works by temporarily making the
  buffer read-only."
  (interactive "P")
  (let ((buffer-read-only t)
        (kill-read-only-ok t))
    (kill-line arg)))

(map! "C-c k" #'copy-line
      "C-c K" #'avy-copy-line)

#+END_SRC

Copy a random region, at any remote location in the frame.

Works with a narrowed (single) avy selection, capturing the beginning of the first selection, and end of the second selection.

Also works, prompting the user to select from a choice of avy candidates.

#+BEGIN_SRC elisp

(require 'cl-lib)

(defun zipmap (keys values)
  (cl-pairlis keys values))

(defun sunra/avy-read-process-window-in-list (list)
  (mapcar
   (lambda (triplet)
     (let ((first (nth 0 triplet))
           (last (nth 2 triplet))
           line-number
           substring
           buffer
           selection-candidate)

       (save-window-excursion
         (select-window last)
         (goto-char first)

         (setq line-number (line-number-at-pos))
         (setq substring (buffer-substring-no-properties first (nth 1 triplet)))
         (setq buffer (window-buffer last))
         (setq selection-candidate (format "%d %s %s" line-number substring buffer)))

       (list selection-candidate line-number substring buffer)))
   list))

(defun sunra/avy-read-candidates-prompt (candidates)

  (let* ((cans (sunra/avy-read-process-window-in-list candidates))
         (hashes (mapcar (lambda (c)
                           (secure-hash 'sha1 (car c)))
                         cans))
         (cadidates-selections-hash (zipmap hashes candidates))

         ;; Take selection, get hash, compare
         (the-selection (completing-read "Select a match: " (mapcar #'car cans)))
         (the-selection-hash (secure-hash 'sha1 the-selection)))

    (alist-get the-selection-hash cadidates-selections-hash nil nil #'string=)))

(defun sunra/avy-read-candidates-return ()

  ;; Read candidates from User prompt
  (let* ((candidates (avy--read-candidates))
         (flat-cands (mapcar #'flatten-list candidates)))

    ;; Conditionally narrow candidates if many, or select the one
    (if (> (length flat-cands) 1)
       (sunra/avy-read-candidates-prompt flat-cands)
      (car flat-cands))))

(defun sunra/copy-remote-region ()
  (interactive)

  ;; Make avy wait a (practically) infinate amount of time
  (let ((avy-timeout-seconds most-positive-fixnum))

    (let* ((triplet-start (sunra/avy-read-candidates-return))
           (candidate-start-position-start (nth 0 triplet-start))
           (window (nth 2 triplet-start))

           (triplet-end (sunra/avy-read-candidates-return))
           (candidate-end-position-end (nth 1 triplet-end)))

      (save-window-excursion

        (select-window window)

        (kill-new
         (buffer-substring-no-properties
          candidate-start-position-start
          candidate-end-position-end))))))

#+END_SRC


** Completions

*** Context

Exploring the optimal Emacs Completions with

#+BEGIN_EXAMPLE
Vertigo
vs Helm
vs Counsel (used in Doom)
vs Consult (improvement over counsel? - https://github.com/minad/consult)
#+END_EXAMPLE

Using Emacs Episode 80 - Vertico, Marginalia, Consult, and Embark
- https://www.youtube.com/watch?v=5ffb2at2d7w

Streamline Your Emacs Completions with Vertico
- https://www.youtube.com/watch?v=J0OaRy85MOo
- https://systemcrafters.cc/emacs-tips/streamline-completions-with-vertico
- https://github.com/minad/vertico


*** Research

Emacs Completion Explained
- https://www.youtube.com/watch?v=fnE0lXoe7Y0

Using Emacs Episode 80 - Vertico, Marginalia, Consult, and Embark
- https://www.youtube.com/watch?v=5ffb2at2d7w
- https://cestlaz.github.io/post/using-emacs-80-vertico

Emacs: completion framework (Embark, Consult, Orderless, etc.)
- https://www.youtube.com/watch?v=43Dg5zYPHTU
- https://protesilaos.com/codelog/2021-01-06-emacs-default-completion


"One important feature is that it plugs in directly to Emacs' own completion engine unlike Helm and Ivy which have their own layer on top."
- https://systemcrafters.cc/emacs-tips/streamline-completions-with-vertico

[no] Helm, Ivy, have been superceded

[ok] Annotations exist on command execution and help menus. Addition not needed.
- Marginalia - https://github.com/minad/marginalia


*** Outcome

**** A. These are the packages I settled on.

- Vertico - https://github.com/minad/vertico
  - Completion-at-point - https://github.com/minad/vertico#completion-at-point-and-completion-in-region
  - Corfu - https://github.com/minad/corfu
- Consult - https://github.com/minad/consult
- Embark - https://github.com/oantolin/embark
- Orderless (vs Prescient, Selectrum)
  - https://github.com/oantolin/orderless
  - https://github.com/radian-software/prescient.el
  - https://github.com/radian-software/selectrum


**** B. Lo and behold, these are most of the choices that Doom makes in its `completion/vertico` module.

So all I had to do was enable it: `(doom! :completion  vertico)` ([ref](https://github.com/doomemacs/doomemacs/tree/master/modules/completion/vertico)).

- Vertico, which provides the vertical completion user interface
- Consult, which provides a suite of useful commands using completing-read
- Embark, which provides a set of minibuffer actions
- Marginalia, which provides annotations to completion candidates
- Orderless, which provides better filtering methods

#+begin_src elisp
(after! vertico

  (vertico-buffer-mode)
  (setq completion-styles '(orderless basic)))

;; (use-package! corfu
;;
;;   ;; Optional customizations
;;   :custom
;;   (corfu-cycle t)                ;; Enable cycling for `corfu-next/previous'
;;   (corfu-auto t)                 ;; Enable auto completion
;;   (corfu-separator ?\s)          ;; Orderless field separator
;;   (corfu-quit-at-boundary nil)   ;; Never quit at completion boundary
;;   (corfu-quit-no-match nil)      ;; Never quit, even if there is no match
;;   ;; (corfu-preview-current nil)    ;; Disable current candidate preview
;;   ;; (corfu-preselect-first nil)    ;; Disable candidate preselection
;;   ;; (corfu-on-exact-match nil)     ;; Configure handling of exact matches
;;   ;; (corfu-echo-documentation nil) ;; Disable documentation in the echo area
;;   ;; (corfu-scroll-margin 5)        ;; Use scroll margin
;;
;;   ;; Enable Corfu only for certain modes.
;;   :hook ((prog-mode . corfu-mode)
;;          (org-mode . corfu-mode)
;;          (shell-mode . corfu-mode)
;;          (eshell-mode . corfu-mode))
;;
;;   ;; Recommended: Enable Corfu globally.
;;   ;; This is recommended since Dabbrev can be used globally (M-/).
;;   ;; See also `corfu-excluded-modes'.
;;   :init
;;   (global-corfu-mode))

;; A few more useful configurations...
(use-package! emacs
  :init
  ;; TAB cycle if there are only few candidates
  (setq completion-cycle-threshold 3)

  ;; Emacs 28: Hide commands in M-x which do not apply to the current mode.
  ;; Corfu commands are hidden, since they are not supposed to be used via M-x.
  ;; (setq read-extended-command-predicate
  ;;       #'command-completion-default-include-p)

  ;; Enable indentation+completion using the TAB key.
  ;; `completion-at-point' is often bound to M-TAB.
  (setq tab-always-indent 'complete))
#+END_SRC


**** CAPFs

#+BEGIN_QUOTE
Completions are either provided by commands like dabbrev-completion or by pluggable backends (completion-at-point-functions, Capfs).

Most programming language major modes implement a Capf. Furthermore the language server packages, Eglot and Lsp-mode, use Capfs which talk to the LSP server to retrieve the completions.

Corfu does not include its own completion backends.
The Emacs built-in Capfs and the Capfs provided by other programming language packages are usually sufficient.

A few additional Capfs and completion utilities are provided by the Cape package.
#+END_QUOTE


From this blurb taken from the [[https://github.com/minad/corfu#corfuel---completion-overlay-region-function][corfu.el repo]], I'm settling on these `completion-aat-point-functions`.

- [[https://github.com/minad/cape][Cape]] - Completion At Point Extensions
- [[https://github.com/joaotavora/eglot][Eglot]] - A client for LSP servers

Initial config stolen from this thread.
- [[https://git.sr.ht/~gagbo/doom-config/tree/master/item/modules/completion/corfu][B]]
- [[https://github.com/doomemacs/doomemacs/issues/5600][A]]

#+BEGIN_SRC elisp

(use-package! cape
  :defer t
  :init
  (map! [remap dabbrev-expand] 'cape-dabbrev)
  (add-to-list 'completion-at-point-functions #'cape-file)
  (add-to-list 'completion-at-point-functions #'cape-dabbrev t))


;; (use-package! corfu-history
;;   :after corfu
;;   :hook (corfu-mode . (lambda ()
;;                         (corfu-history-mode 1)
;;                         (savehist-mode 1)
;;                         (add-to-list 'savehist-additional-variables 'corfu-history))))

(use-package! corfu-quick
  ;; :after corfu
  :bind (:map corfu-map
         ("M-q" . corfu-quick-complete)
         ("C-q" . corfu-quick-insert)))

#+END_SRC

And Flymake configs for Eglot.

#+BEGIN_SRC elisp
;; (use-package! flymake
;;   :config
;;   (setq flymake-start-on-flymake-mode t)
;;   (setq flymake-no-changes-timeout nil)
;;   (setq flymake-start-on-save-buffer t))
;;
;; (use-package! flymake-kondor
;;   :hook (clojure-mode . flymake-kondor-setup))
#+END_SRC


