.doom.d/sunra.el
;; (defun copy-line (&optional arg)
;;   "Do a kill-line but copy rather than kill.  This function directly calls
;;   kill-line, so see documentation of kill-line for how to use it including prefix
;;   argument and relevant variables.  This function works by temporarily making the
;;   buffer read-only."
;;   (interactive "P")
;;   (let ((buffer-read-only t)
;;         (kill-read-only-ok t))
;;     (kill-line arg)))
;;
;; (map! "C-c k" #'copy-line
;;       "C-c K" #'avy-copy-line)
;;
;; (require 'cl-lib)
;;
;; (defun zipmap (keys values)
;;   (cl-pairlis keys values))
;;
;; (defun sunra/avy-read-process-window-in-list (list)
;;   (mapcar
;;    (lambda (triplet)
;;      (let ((first (nth 0 triplet))
;;            (last (nth 2 triplet))
;;            line-number
;;            substring
;;            buffer
;;            selection-candidate)
;;
;;        (save-window-excursion
;;          (select-window last)
;;          (goto-char first)
;;
;;          (setq line-number (line-number-at-pos))
;;          (setq substring (buffer-substring-no-properties first (nth 1 triplet)))
;;          (setq buffer (window-buffer last))
;;          (setq selection-candidate (format "%d %s %s" line-number substring buffer)))
;;
;;        (list selection-candidate line-number substring buffer)))
;;    list))
;;
;; (defun sunra/avy-read-candidates-prompt (candidates)
;;
;;   (let* ((cans (sunra/avy-read-process-window-in-list candidates))
;;          (hashes (mapcar (lambda (c)
;;                            (secure-hash 'sha1 (car c)))
;;                          cans))
;;          (cadidates-selections-hash (zipmap hashes candidates))
;;
;;          ;; Take selection, get hash, compare
;;          (the-selection (completing-read "Select a match: " (mapcar #'car cans)))
;;          (the-selection-hash (secure-hash 'sha1 the-selection)))
;;
;;     (alist-get the-selection-hash cadidates-selections-hash nil nil #'string=)))
;;
;; (defun sunra/avy-read-candidates-return ()
;;
;;   ;; Read candidates from User prompt
;;   (let* ((candidates (avy--read-candidates))
;;          (flat-cands (mapcar #'flatten-list candidates)))
;;
;;     ;; Conditionally narrow candidates if many, or select the one
;;     (if (> (length flat-cands) 1)
;;        (sunra/avy-read-candidates-prompt flat-cands)
;;       (car flat-cands))))
;;
;; (defun sunra/copy-remote-region ()
;;   (interactive)
;;
;;   ;; Make avy wait a (practically) infinate amount of time
;;   (let ((avy-timeout-seconds most-positive-fixnum))
;;
;;     (let* ((triplet-start (sunra/avy-read-candidates-return))
;;            (candidate-start-position-start (nth 0 triplet-start))
;;            (window (nth 2 triplet-start))
;;
;;            (triplet-end (sunra/avy-read-candidates-return))
;;            (candidate-end-position-end (nth 1 triplet-end)))
;;
;;       (save-window-excursion
;;
;;         (select-window window)
;;
;;         (kill-new
;;          (buffer-substring-no-properties
;;           candidate-start-position-start
;;           candidate-end-position-end))))))
;;
;; (after! vertico
;;
;;   (vertico-buffer-mode)
;;   (setq completion-styles '(orderless basic)))
;;
;; ;; (use-package! corfu
;; ;;
;; ;;   ;; Optional customizations
;; ;;   :custom
;; ;;   (corfu-cycle t)                ;; Enable cycling for `corfu-next/previous'
;; ;;   (corfu-auto t)                 ;; Enable auto completion
;; ;;   (corfu-separator ?\s)          ;; Orderless field separator
;; ;;   (corfu-quit-at-boundary nil)   ;; Never quit at completion boundary
;; ;;   (corfu-quit-no-match nil)      ;; Never quit, even if there is no match
;; ;;   ;; (corfu-preview-current nil)    ;; Disable current candidate preview
;; ;;   ;; (corfu-preselect-first nil)    ;; Disable candidate preselection
;; ;;   ;; (corfu-on-exact-match nil)     ;; Configure handling of exact matches
;; ;;   ;; (corfu-echo-documentation nil) ;; Disable documentation in the echo area
;; ;;   ;; (corfu-scroll-margin 5)        ;; Use scroll margin
;; ;;
;; ;;   ;; Enable Corfu only for certain modes.
;; ;;   :hook ((prog-mode . corfu-mode)
;; ;;          (org-mode . corfu-mode)
;; ;;          (shell-mode . corfu-mode)
;; ;;          (eshell-mode . corfu-mode))
;; ;;
;; ;;   ;; Recommended: Enable Corfu globally.
;; ;;   ;; This is recommended since Dabbrev can be used globally (M-/).
;; ;;   ;; See also `corfu-excluded-modes'.
;; ;;   :init
;; ;;   (global-corfu-mode))
;;
;; ;; A few more useful configurations...
;; (use-package! emacs
;;   :init
;;   ;; TAB cycle if there are only few candidates
;;   (setq completion-cycle-threshold 3)
;;
;;   ;; Emacs 28: Hide commands in M-x which do not apply to the current mode.
;;   ;; Corfu commands are hidden, since they are not supposed to be used via M-x.
;;   ;; (setq read-extended-command-predicate
;;   ;;       #'command-completion-default-include-p)
;;
;;   ;; Enable indentation+completion using the TAB key.
;;   ;; `completion-at-point' is often bound to M-TAB.
;;   (setq tab-always-indent 'complete))
;;
;; (use-package! cape
;;   :defer t
;;   :init
;;   (map! [remap dabbrev-expand] 'cape-dabbrev)
;;   (add-to-list 'completion-at-point-functions #'cape-file)
;;   (add-to-list 'completion-at-point-functions #'cape-dabbrev t))
;;
;;
;; ;; (use-package! corfu-history
;; ;;   :after corfu
;; ;;   :hook (corfu-mode . (lambda ()
;; ;;                         (corfu-history-mode 1)
;; ;;                         (savehist-mode 1)
;; ;;                         (add-to-list 'savehist-additional-variables 'corfu-history))))
;;
;; (use-package! corfu-quick
;;   ;; :after corfu
;;   :bind (:map corfu-map
;;          ("M-q" . corfu-quick-complete)
;;          ("C-q" . corfu-quick-insert)))
;;
;; ;; (use-package! flymake
;; ;;   :config
;; ;;   (setq flymake-start-on-flymake-mode t)
;; ;;   (setq flymake-no-changes-timeout nil)
;; ;;   (setq flymake-start-on-save-buffer t))
;; ;;
;; ;; (use-package! flymake-kondor
;; ;;   :hook (clojure-mode . flymake-kondor-setup))
;;
;; (map! :map general-override-mode-map
