.doom.d/SUNRA.org
**** Consult


#+BEGIN_SRC elisp
(map! :map general-override-mode-map
      "C-x b" #'consult-buffer
      "M-m s s" #'consult-line
      "M-m s S" #'consult-line-multi
      "M-y" #'consult-yank-from-kill-ring)
#+END_SRC


**** Embark Consult

Sets up compatibility layer between the two packages.
https://elpa.gnu.org/packages/embark-consult.html

This should just work out of the box.

#+BEGIN_SRC elisp
(use-package! embark-consult)
#+END_SRC


** Denote (Org-Roam replacement)

For Knowledge Management. Document everything, making it searchable.

https://github.com/protesilaos/denote

Emacs: introduction to Denote (simple note-taking)
https://www.youtube.com/watch?v=mLzFJcLpDFI

Is migrating to denote worth it?
https://www.reddit.com/r/emacs/comments/19do7da/is_migrating_to_denote_worth_it

*** Links

In the Denote emacs package (https://github.com/protesilaos/denote),
Denote notes are in `.md` format. And a denote link (to another note) cannot also be an HTTP hyperlink. They are different constructs.

For standard Denote links to other notes in Markdown format, the syntax looks like this.
#+BEGIN_EXAMPLE
[[denote:20230815T102233][Title of note]]
#+END_EXAMPLE

And HTTP hyperlinks in Markdown use the standard Markdown syntax:
#+BEGIN_EXAMPLE
[Link text](https://example.com)
#+END_EXAMPLE

So the strategy will be to place them adjacent to each other if needed.



#+BEGIN_SRC elisp
(after! denote

  (use-package! denote
    :config
    (setq denote-directory (expand-file-name "~/Projects/notes/")
          denote-known-keywords '("emacs" "clojure" "guix")
          denote-infer-keywords t
          denote-sort-keywords t
          denote-file-type 'markdown-yaml ; Org is the default, set others here
          denote-prompts '(title keywords)
          denote-excluded-directories-regexp nil
          denote-excluded-keywords-regexp nil)))
#+END_SRC

*** OLD:ARCHIVE: Org-Roam

This is the old Org-Roam configuration, since replaced by Denote.
These are references and notes, including howto videos.

- https://www.orgroam.com/
- https://github.com/org-roam/org-roam
- https://lucidmanager.org/productivity/taking-notes-with-emacs-org-mode-and-org-roam/
[[How I Take Notes with Org-Roam][- https://jethrokuan.github.io/org-roam-guide/]]
- [[https://www.youtube.com/watch?v=rH3ZH95zjKM][Org Roam Setup · Emacs Doomcasts 25]]
- [[https://www.youtube.com/watch?v=83JoRBjTXog][Aliases in Org Roam Emacs Doom · Emacs Doomcasts 26]]
- [[https://www.youtube.com/watch?v=AyhPmypHDEw][Getting Started with Org Roam - Build a Second Brain in Emacs]]
- [[https://www.youtube.com/watch?v=3H38Yglw1dU][The Goal: Building My Second Brain with Emacs and Org-Roam (An Overview)]]

#+BEGIN_SRC elisp
;; (after! org-roam
;;
;;   (setq org-roam-directory (file-truename "~/roam"))
;;
;;   ;; add markdown extension to org-roam-file-extensions list
;;   (setq org-roam-file-extensions '("org" "md")) ; enable Org-roam for a markdown extension
;;   (setq org-roam-title-sources '((mdtitle title mdheadline headline) (mdalias alias)))
;;
;;   (add-to-list 'load-path (file-truename "~/.emacs.d/.local/straight/repos/md-roam"))
;;
;;   ;; Configs taken from the home repo
;;   ;; https://github.com/org-roam/org-roam#configuration
;;   (setq org-roam-node-display-template (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
;;   )
#+END_SRC

Note: I had to manually eval `use-package md-roam`, in order to have it compile and run.
Otherwise I ran into [this error](https://discord.com/channels/406534637242810369/1028497228148518932) loading the package.

#+BEGIN_SRC elisp
;; (use-package! md-roam
;;  :config
;;
;;  ;; (setq md-roam-file-extension-single "md")
;;  (md-roam-mode 1) ; md-roam-mode must be active before org-roam-db-sync
;;  (setq md-roam-file-extension "md") ; default "md". Specify an extension such as "markdown"
;;  (org-roam-db-autosync-mode 1) ; autosync-mode triggers db-sync. md-roam-mode must be already active
;;
;;  (add-to-list 'org-roam-capture-templates
;;               '("m" "Markdown" plain "" :target
;;                 (file+head "${slug}.md"
;;                            "---\ntitle: ${title}\nid: %<%Y-%m-%dT%H%M%S>\ncategory: \n---\n")
;;                 :unnarrowed t))
;;
;;  (with-eval-after-load 'markdown-mode
;;   (advice-add #'markdown-indent-line :before-until #'completion-at-point)))
#+END_SRC


** ChatGPT



*** Overview

https://github.com/karthink/gptel?tab=readme-ov-file#gptel-a-simple-llm-client-for-emacs

`karthink/gptel` is a simple Large Language Model chat client for Emacs, with support for multiple models and backends. It works in the spirit of Emacs, available at any time and uniformly in any buffer.



*** Features

https://github.com/karthink/gptel?tab=readme-ov-file#contents

**** Rewrite a Region

https://github.com/karthink/gptel?tab=readme-ov-file#rewrite-refactor-or-fill-in-a-region

**** Tool Use

Tool use (experimental)
https://github.com/karthink/gptel?tab=readme-ov-file#tool-use-experimental

Tool use with gptel: looking for testers!
https://karthinks.com/software/tool-use-with-gptel-looking-for-testers/

Instructions for testing tool use (on gptel’s issue tracke)
https://github.com/karthink/gptel/issues/514



*** File Templating

I needed File templating like what we get in cgrande/enlive.
https://github.com/cgrand/enlive

The template DSL looks like below, where
the contents of file =Content.md= (~Bar~) and
contents of variable =thing= (~querty~), are combined with =A.md.tmpl= and output to =A.md=.

#+BEGIN_EXAMPLE
#Content.md
Bar
#+END_EXAMPLE

#+BEGIN_EXAMPLE
#A.md.tmpl
Foo {file:Content.md}
{var:thing}
#+END_EXAMPLE

#+BEGIN_EXAMPLE
#A.md
Foo Bar
querty
#+END_EXAMPLE


None of these solutions quite fit the bill.
- https://github.com/mineo/yatemplate
- https://www.emacswiki.org/emacs/TemplatesMode
- https://www.emacswiki.org/emacs/defaultcontent.el

Most of what's available in Emacs are snippet libraries like joaotavora/yasnippet or minad/tempel
- https://www.emacswiki.org/emacs/CategoryTemplates

Thus begat =apply-template= and =apply-templates=.


*** Tool Use

LLM "tools" are functions you supply to the LLM... that it can use to do work for you in the world (your file system, web, etc).
My comment in this article documents my "ah ha" moment.
https://karthinks.com/software/tool-use-with-gptel-looking-for-testers/#remark42__comment-ff369a61-5e0e-45a1-8834-fdc4a8db0e36

There are a suite of LLM "tools" in the ~gptel/tools~ directory.
But I wanted to create a tool that generates a tool (that uses `gptel-make-tool`) from an existing elisp function.
=generate_llm_tool= is a i. function and ii. LLM tool that does just that.

This tool:
1. Takes a function name and a category as input
2. Checks if the function exists and is callable
3. Extracts the function's argument list and documentation
4. Creates properly formatted argument descriptors for each parameter
5. Builds a complete gptel-make-tool definition with all the required parts
6. Returns either the tool definition or an error message

The generated tool will:
- Use the original function's name as the tool name
- Use the first line of the docstring as the tool description
- Use the function itself directly via #'function-name
- Generate simple argument descriptors based on the parameter names
- Use the provided category


