.doom.d/sunra.el
;;       "C-x b" #'consult-buffer
;;       "M-m s s" #'consult-line
;;       "M-m s S" #'consult-line-multi
;;       "M-y" #'consult-yank-from-kill-ring)
;;
;; (use-package! embark-consult)
;;
;; (after! denote
;;
;;   (use-package! denote
;;     :config
;;     (setq denote-directory (expand-file-name "~/Projects/notes/")
;;           denote-known-keywords '("emacs" "clojure" "guix")
;;           denote-infer-keywords t
;;           denote-sort-keywords t
;;           denote-file-type 'markdown-yaml ; Org is the default, set others here
;;           denote-prompts '(title keywords)
;;           denote-excluded-directories-regexp nil
;;           denote-excluded-keywords-regexp nil)))
;;
;; ;; (after! org-roam
;; ;;
;; ;;   (setq org-roam-directory (file-truename "~/roam"))
;; ;;
;; ;;   ;; add markdown extension to org-roam-file-extensions list
;; ;;   (setq org-roam-file-extensions '("org" "md")) ; enable Org-roam for a markdown extension
;; ;;   (setq org-roam-title-sources '((mdtitle title mdheadline headline) (mdalias alias)))
;; ;;
;; ;;   (add-to-list 'load-path (file-truename "~/.emacs.d/.local/straight/repos/md-roam"))
;; ;;
;; ;;   ;; Configs taken from the home repo
;; ;;   ;; https://github.com/org-roam/org-roam#configuration
;; ;;   (setq org-roam-node-display-template (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
;; ;;   )
;;
;; ;; (use-package! md-roam
;; ;;  :config
;; ;;
;; ;;  ;; (setq md-roam-file-extension-single "md")
;; ;;  (md-roam-mode 1) ; md-roam-mode must be active before org-roam-db-sync
;; ;;  (setq md-roam-file-extension "md") ; default "md". Specify an extension such as "markdown"
;; ;;  (org-roam-db-autosync-mode 1) ; autosync-mode triggers db-sync. md-roam-mode must be already active
;; ;;
;; ;;  (add-to-list 'org-roam-capture-templates
;; ;;               '("m" "Markdown" plain "" :target
;; ;;                 (file+head "${slug}.md"
;; ;;                            "---\ntitle: ${title}\nid: %<%Y-%m-%dT%H%M%S>\ncategory: \n---\n")
;; ;;                 :unnarrowed t))
;; ;;
;; ;;  (with-eval-after-load 'markdown-mode
;; ;;   (advice-add #'markdown-indent-line :before-until #'completion-at-point)))
;;
