.doom.d/SUNRA.org
** Screenshots and Audio / Video recording


=screenshot= is an Emacs lisp function that can
i. take a shot of desktop screen or ii. shot of an active Emacs window
using the CLI =Image Magick=, or ~screencapture~ on MacOS

Usage
#+BEGIN_EXAMPLE elisp
(screenshot)    ;; Entire desktop with all active windows
(screenshot t)  ;; Call with emacs-frame-only
#+END_EXAMPLE


#+BEGIN_SRC elisp

(require 'cl-lib)

(defun screenshot (&optional emacs-frame-only)
  "Take a screenshot and save it to a file.
With prefix argument ARG, capture the current active Emacs frame only.
Otherwise, capture the entire screen."
  (interactive "P")
  (let* ((default-directory (expand-file-name "~/Pictures/"))
         (timestamp (format-time-string "%Y%m%d-%H%M%S"))
         (file-name (concat "screenshot-" timestamp ".png"))
         (full-path (expand-file-name file-name))
         (command
          (cond
           ((eq system-type 'darwin)
            (if emacs-frame-only
                (format "screencapture -l$(osascript -e 'tell app \"Emacs\" to id of window 1') %s"
                        (shell-quote-argument full-path))
              (format "screencapture %s"
                      (shell-quote-argument full-path))))
           ((eq system-type 'gnu/linux)
            (if emacs-frame-only
                (format "ffmpeg -y -f x11grab -i 0x%s -vframes 1 %s"
                        (frame-parameter nil 'outer-window-id)
                        (shell-quote-argument full-path))
              (format "ffmpeg -y -f x11grab -i :0 -vframes 1 %s"
                      (shell-quote-argument full-path))))
           (t (error "No suitable screenshot command found for this system")))))
    (make-directory (file-name-directory full-path) t)
    (if (zerop (shell-command command))
        (progn
          (message "Screenshot saved to %s" full-path)
          (when (y-or-n-p "Open screenshot? ")
            (find-file full-path)))
      (error "Failed to take screenshot"))))


;; `screenshot` is an Emacs lisp function that can
;; i. take a shot of desktop screen or ii. shot of an active Emacs window
;; using the CLI =Image Magick=, or ~screencapture~ on MacOS
;;
;; Usage
;; ;; (setq debug-on-error t)
;; ;; (toggle-debug-on-error)

;; (screenshot)
;; (screenshot t)

(defun screencapture (screen-id &optional duration)
  "Record the screen with SCREEN-ID for DURATION seconds using ffmpeg’s avfoundation input.
   SCREEN-ID is the device index shown when running:
   ffmpeg -f avfoundation -list_devices true -i \"\"

By default, DURATION is 5 seconds.  The resulting file is placed in ~/Pictures/ with a timestamp.

On non-macOS systems, this function currently signals an error."
  (interactive "nEnter screen device index: \nnDuration in seconds (default 5): ")
  (unless duration
    (setq duration 5))

  (let* ((default-directory (expand-file-name "~/Pictures/"))
         (timestamp (format-time-string "%Y%m%d-%H%M%S"))
         (file-name (concat "screencapture-" timestamp ".mp4"))
         (full-path (expand-file-name file-name))
         ;; Construct the ffmpeg command for avfoundation
         (command (format "ffmpeg -y -f avfoundation -i %s:0 -t %s %s"
                          screen-id
                          duration
                          (shell-quote-argument full-path))))
    (make-directory (file-name-directory full-path) t)
    (if (zerop (shell-command command))
        (progn
          (message "Screen recording saved to %s" full-path))
      (error "Failed to record from screen ID %s" screen-id))))

;; Usage

;; Record the desktop from screen 3 for 10 seconds
;; (screencapture 3 10)
;;
;; Record the desktop from screen 2 for 5 seconds
;; (screencapture 2 5)

;; # ffmpeg can list out the available desktop screen devices
;; ffmpeg -f avfoundation -list_devices true -i ""
;; ...
;; [AVFoundation indev @ 0x12a804080] AVFoundation video devices:
;; [AVFoundation indev @ 0x12a804080] [0] LG UltraFine Display Camera
;; [AVFoundation indev @ 0x12a804080] [1] FaceTime HD Camera
;; [AVFoundation indev @ 0x12a804080] [2] Capture screen 0
;; [AVFoundation indev @ 0x12a804080] [3] Capture screen 1
;; [AVFoundation indev @ 0x12a804080] AVFoundation audio devices:
;; [AVFoundation indev @ 0x12a804080] [0] LG UltraFine Display Audio
;; [AVFoundation indev @ 0x12a804080] [1] MacBook Pro Microphone
;; [AVFoundation indev @ 0x12a804080] [2] Bose QC45

#+END_SRC


** Web Search

*** Task

This follows work to allow Emacs (and our LLM(s)) perform web searches.

Research and web search options are in the Jira ticket: Emacs: GPTel Search the Web
https://interruptsoftware.atlassian.net/browse/TECH-106

The currently selected option is "Linkup".

*** Tool

Linkup is "World’s best search for AI Apps"
https://www.linkup.so
https://docs.linkup.so/pages/documentation/get-started/quickstart
https://docs.linkup.so/pages/documentation/get-started/concepts

=/search= query format is here:
HTTP POST https://docs.linkup.so/pages/documentation/api-reference/endpoint/post-search

This is a sample curl call.
#+BEGIN_EXAMPLE
curl "https://api.linkup.so/v1/search" \
    -G \
    -H "Authorization: Bearer $LINKUP_API_KEY" \
    --data-urlencode "q=What is Microsoft's 2024 revenue?" \
    --data-urlencode "depth=deep" \
    --data-urlencode "outputType=sourcedAnswer"
#+END_EXAMPLE

*** Solution

The =websearch= function makes a REST call to the "Linkup" web search API. It uses Emacs' =plz= HTTP library.
https://github.com/alphapapa/plz.el

The function takes the parameters ~query~ ~linkup_api_key~ and ~depth~ and plugs them into the REST API call.

#+BEGIN_SRC elisp

(use-package! plz)

(defun websearch (query &optional api-key &optional depth)
  "Search Linkup API with QUERY using the corresponding API-KEY.
   Optional DEPTH parameter can be 'deep or 'shallow (defaults to deep).
   Returns response as parsed JSON or signals an error."
  (condition-case err
      (let* ((depth-value (or depth "deep"))
             (linkup-api-key (or api-key linkup-api-key))
             (json-object (json-encode
                           `(("q" . ,query)
                             ("depth" . ,depth-value)
                             ("outputType" . "sourcedAnswer")
                             ("includeImages" . "false"))))
             (url-request-method "POST")
             (url-request-extra-headers
              `(("Authorization" . ,(concat "Bearer " linkup-api-key))
                ("Content-Type" . "application/json")))
             (url-request-data json-object)
             (buffer (url-retrieve-synchronously
                      "https://api.linkup.so/v1/search" t)))
        (if buffer
            (with-current-buffer buffer
              (goto-char url-http-end-of-headers)
              (let ((json-response (json-read)))
                (kill-buffer buffer)
                (if (and (listp json-response) json-response)
                    json-response
                  (error "Invalid response format from Linkup API"))))
          (error "No response from Linkup API")))

    (json-error
     (error "Failed to parse Linkup API response: %s" (error-message-string err)))

    (error
     (error "Linkup search error: %s" (error-message-string err)))))

;; ;; Example usage:
;; (websearch "What is Microsoft's 2024 revenue?"
;;            "7c913f85-698f-487f-a95b-a5dc949f50f3")
;; (websearch "What is Microsoft's 2024 revenue?"
;;            "7c913f85-698f-487f-a95b-a5dc949f50f3"
;;            "deep")

#+END_SRC


** Emacs Client


[[https://www.youtube.com/watch?v=ZjCRxAMPdNc][Unlock the Power of the Daemon with emacsclient]]
Reload Doom config

emacs --daemon
emacsclient

. Setting these guys
$EDITOR=emacsclient
/Applications/Emacs.app/Contents/MacOS/Emacs --daemon
/Applications/Emacs.app/Contents/MacOS/bin/emacsclient -cn

. Created EmacsDaemon, EmacsClient as launchable apps, as per:
https://stackoverflow.com/questions/10376206/what-is-the-preferred-bash-shebang


** Miscellaneous

