.doom.d/SUNRA.org
*** Define persistent link in Org

Define persistent link in Org.
Unique and unbreakable headings in Org files.

#+BEGIN_SRC elisp

(defun prot-org--id-get (&optional pom create prefix)
  "Get the CUSTOM_ID property of the entry at point-or-marker POM.

If POM is nil, refer to the entry at point.
If the entry does not have an CUSTOM_ID, the function returns nil. However, when
CREATE is non nil, create a CUSTOM_ID if none is present already.
PREFIX will be passed through to `org-id-new'.  In any case, the
CUSTOM_ID of the entry is returned."
  (org-with-point-at pom
    (let ((id (org-entry-get nil "CUSTOM_ID")))
      (cond
       ((and id (stringp id) (string-match "\\S-" id))
        id)
       (create
        (setq id (org-id-new (concat prefix "h")))
        (org-entry-put pom "CUSTOM_ID" id)
        (org-id-add-location id (format "%s" (buffer-file-name (buffer-base-buffer))))
        id)))))

(declare-function org-map-entries "org")

;;;###autoload
(defun prot-org-id-headlines ()
  "Add missing CUSTOM_ID to all headlines in current file."
  (interactive)
  (org-map-entries
   (lambda () (prot-org--id-get (point) t))))

#+END_SRC


*** Configuration: org-insert-structure-template

=org-insert-structure-template=
~org-insert-structure-template~

#+BEGIN_SRC elisp

(setq org-structure-template-alist
        '(("s" . "src")
          ("E" . "src emacs-lisp")
          ("e" . "example")
          ("q" . "quote")
          ("v" . "verse")
          ("V" . "verbatim")
          ("c" . "center")
          ("C" . "comment")))

#+END_SRC


*** Outlining Structured Files

Functions for outlining a structured file.

#+BEGIN_EXAMPLE elisp
consult-outline ; especially for Org
consult-imenu   ; for programming
consult-line    ; in-buffer search with previews
consult-grep    ; async+live grep with preview
consult-ripgrep ; same but for ripgrep
#+END_EXAMPLE


*** Embark Keymap Configuration

See more examples at [[https://github.com/oantolin/embark?tab=readme-ov-file#acting-on-targets][the source]].

#+BEGIN_EXAMPLE elisp

;; Old Emacs (always works)
(defvar my-embark-region-map
  (let ((map (make-sparse-keymap)))
    (define-key map (kbd "a") 'some-command)
    (define-key map (kbd "e") 'some-command)
    map)
  "My keymap for Embark region actions.")

;; For Emacs 29+
(defvar-keymap my-embark-region-map
  :doc "Some documentation"
  "a" 'some-command
  "b" 'some-other-command)


(setq embark-keymap-alist
      '((file embark-file-map)
        (library embark-library-map)
        (environment-variables embark-file-map) ; they come up in file completion
        (url embark-url-map)
        (email embark-email-map)
        (buffer embark-buffer-map)
        (tab embark-tab-map)
        (expression embark-expression-map)
        (identifier embark-identifier-map)
        (defun embark-defun-map)
        (symbol embark-symbol-map)
        (face embark-face-map)
        (command embark-command-map)
        (variable embark-variable-map)
        (function embark-function-map)
        (minor-mode embark-command-map)
        (unicode-name embark-unicode-name-map)
        (package embark-package-map)
        (bookmark embark-bookmark-map)
        ;; (region embark-region-map)
        (region my-embark-region-map)
        (sentence embark-sentence-map)
        (paragraph embark-paragraph-map)
        (kill-ring embark-kill-ring-map)
        (heading embark-heading-map)
        (t embark-general-map)))

#+END_EXAMPLE


*** Insert Text in read-only Buffers

Insert text even if the buffer is read-only

#+BEGIN_EXAMPLE elisp

(let ((inhibit-read-only t))
  (insert "\nHello"))

#+END_EXAMPLE


*** Emacs Window Management

#+BEGIN_EXAMPLE elisp

(add-to-list 'display-buffer-alist
             '("\\*eww\\*"
               (display-buffer-reuse-mode-window display-buffer-same-window)))

#+END_EXAMPLE



** TODOs

*** Org-Roam Existing Notes


*** Configure Completion

Configure Capfs:
- cape
- corfu-history
- corfu-quick
- eglot (Clojure)

  See notes: [[https://www.youtube.com/watch?v=ROnceqt3kpE][Using Emacs 74 - Eglot]]

Orderless
Consult
Embark


*** Consult search, ignore case


*** Navigate Mark Ring

Start with these resources.
- [[https://www.youtube.com/watch?v=Dq5UOt63Mms&t=1364s][Efficient Text Selection with Emacs Key Bindings - Emacs Essentials #3 / Remember Your Place with the Mark Ring]]


*** Master Keymaps

[ok] What is full Keymap tree
  https://www.masteringemacs.org/article/mastering-key-bindings-emacs#what-is-a-keymap
  M-x describe-keymap

Fix some key sequences that don't work in all environs


*** Misc

. smartparens, (STRONG) highlight parens
. eval repl (from .clj .edn)

. Emacs Guix
https://emacs-guix.gitlab.io/website/manual/latest/emacs-guix.html#Top


*** Org Journaling


*** Org Presenting


*** Spellcheck Tools and Completions


** Errors


*** Ripgrep is missing from path


*** Hydra mc/mark-next-line double marks cursor

Ie, pressing next selects the next n, instead of the next 1.


*** smartparens open square bracket fails to add closing bracket, when touched by a character
